backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, null, null, 3]
      dtype: float32
      name: input
      sparse: false
    inbound_nodes: []
    name: input
  - class_name: DynamicPaddingLayer
    config: {data_format: channels_last, factor: 16, name: dpad, ndim: 4, trainable: true}
    inbound_nodes:
    - - - input
        - 0
        - 0
        - {}
    name: dpad
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id004 !!python/tuple [1, 1]
      name: c1x1_1
      padding: same
      strides: &id002 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dpad
        - 0
        - 0
        - {}
    name: c1x1_1
  - class_name: Activation
    config: {activation: relu, name: relu_1, trainable: true}
    inbound_nodes:
    - - - c1x1_1
        - 0
        - 0
        - {}
    name: relu_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id005 !!python/tuple [3, 3]
      name: c3x3_1
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_1
        - 0
        - 0
        - {}
    name: c3x3_1
  - class_name: Activation
    config: {activation: relu, name: relu_2, trainable: true}
    inbound_nodes:
    - - - c3x3_1
        - 0
        - 0
        - {}
    name: relu_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id008 !!python/tuple [1, 1]
      name: c1x1_3
      padding: valid
      strides: &id009 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dpad
        - 0
        - 0
        - {}
    name: c1x1_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id006 !!python/tuple [1, 1]
      name: c1x1_2
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_2
        - 0
        - 0
        - {}
    name: c1x1_2
  - class_name: Add
    config: {name: add_1, trainable: true}
    inbound_nodes:
    - - - c1x1_3
        - 0
        - 0
        - &id003 {}
      - - c1x1_2
        - 0
        - 0
        - *id003
    name: add_1
  - class_name: Activation
    config: {activation: relu, name: relu_3, trainable: true}
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: relu_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_4
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_3
        - 0
        - 0
        - {}
    name: c1x1_4
  - class_name: Activation
    config: {activation: relu, name: relu_4, trainable: true}
    inbound_nodes:
    - - - c1x1_4
        - 0
        - 0
        - {}
    name: relu_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_2
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_4
        - 0
        - 0
        - {}
    name: c3x3_2
  - class_name: Activation
    config: {activation: relu, name: relu_5, trainable: true}
    inbound_nodes:
    - - - c3x3_2
        - 0
        - 0
        - {}
    name: relu_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_5
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_5
        - 0
        - 0
        - {}
    name: c1x1_5
  - class_name: Add
    config: {name: add_2, trainable: true}
    inbound_nodes:
    - - - relu_3
        - 0
        - 0
        - &id007 {}
      - - c1x1_5
        - 0
        - 0
        - *id007
    name: add_2
  - class_name: Activation
    config: {activation: relu, name: relu_6, trainable: true}
    inbound_nodes:
    - - - add_2
        - 0
        - 0
        - {}
    name: relu_6
  - class_name: Dropout
    config: {name: do_1, rate: 0.05, trainable: true}
    inbound_nodes:
    - - - relu_6
        - 0
        - 0
        - {}
    name: do_1
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: down2_1
      padding: valid
      pool_size: !!python/tuple [2, 2]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - do_1
        - 0
        - 0
        - {}
    name: down2_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_6
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_1
        - 0
        - 0
        - {}
    name: c1x1_6
  - class_name: Activation
    config: {activation: relu, name: relu_7, trainable: true}
    inbound_nodes:
    - - - c1x1_6
        - 0
        - 0
        - {}
    name: relu_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_3
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_7
        - 0
        - 0
        - {}
    name: c3x3_3
  - class_name: Activation
    config: {activation: relu, name: relu_8, trainable: true}
    inbound_nodes:
    - - - c3x3_3
        - 0
        - 0
        - {}
    name: relu_8
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id008
      name: c1x1_8
      padding: valid
      strides: *id009
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_1
        - 0
        - 0
        - {}
    name: c1x1_8
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_7
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_8
        - 0
        - 0
        - {}
    name: c1x1_7
  - class_name: Add
    config: {name: add_3, trainable: true}
    inbound_nodes:
    - - - c1x1_8
        - 0
        - 0
        - &id010 {}
      - - c1x1_7
        - 0
        - 0
        - *id010
    name: add_3
  - class_name: Activation
    config: {activation: relu, name: relu_9, trainable: true}
    inbound_nodes:
    - - - add_3
        - 0
        - 0
        - {}
    name: relu_9
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_9
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_9
        - 0
        - 0
        - {}
    name: c1x1_9
  - class_name: Activation
    config: {activation: relu, name: relu_10, trainable: true}
    inbound_nodes:
    - - - c1x1_9
        - 0
        - 0
        - {}
    name: relu_10
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_4
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_10
        - 0
        - 0
        - {}
    name: c3x3_4
  - class_name: Activation
    config: {activation: relu, name: relu_11, trainable: true}
    inbound_nodes:
    - - - c3x3_4
        - 0
        - 0
        - {}
    name: relu_11
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_10
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_11
        - 0
        - 0
        - {}
    name: c1x1_10
  - class_name: Add
    config: {name: add_4, trainable: true}
    inbound_nodes:
    - - - relu_9
        - 0
        - 0
        - &id011 {}
      - - c1x1_10
        - 0
        - 0
        - *id011
    name: add_4
  - class_name: Activation
    config: {activation: relu, name: relu_12, trainable: true}
    inbound_nodes:
    - - - add_4
        - 0
        - 0
        - {}
    name: relu_12
  - class_name: Dropout
    config: {name: do_2, rate: 0.05, trainable: true}
    inbound_nodes:
    - - - relu_12
        - 0
        - 0
        - {}
    name: do_2
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: down2_2
      padding: valid
      pool_size: !!python/tuple [2, 2]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - do_2
        - 0
        - 0
        - {}
    name: down2_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_11
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_2
        - 0
        - 0
        - {}
    name: c1x1_11
  - class_name: Activation
    config: {activation: relu, name: relu_13, trainable: true}
    inbound_nodes:
    - - - c1x1_11
        - 0
        - 0
        - {}
    name: relu_13
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_5
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_13
        - 0
        - 0
        - {}
    name: c3x3_5
  - class_name: Activation
    config: {activation: relu, name: relu_14, trainable: true}
    inbound_nodes:
    - - - c3x3_5
        - 0
        - 0
        - {}
    name: relu_14
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id008
      name: c1x1_13
      padding: valid
      strides: *id009
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_2
        - 0
        - 0
        - {}
    name: c1x1_13
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_12
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_14
        - 0
        - 0
        - {}
    name: c1x1_12
  - class_name: Add
    config: {name: add_5, trainable: true}
    inbound_nodes:
    - - - c1x1_13
        - 0
        - 0
        - &id012 {}
      - - c1x1_12
        - 0
        - 0
        - *id012
    name: add_5
  - class_name: Activation
    config: {activation: relu, name: relu_15, trainable: true}
    inbound_nodes:
    - - - add_5
        - 0
        - 0
        - {}
    name: relu_15
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_14
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_15
        - 0
        - 0
        - {}
    name: c1x1_14
  - class_name: Activation
    config: {activation: relu, name: relu_16, trainable: true}
    inbound_nodes:
    - - - c1x1_14
        - 0
        - 0
        - {}
    name: relu_16
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_6
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_16
        - 0
        - 0
        - {}
    name: c3x3_6
  - class_name: Activation
    config: {activation: relu, name: relu_17, trainable: true}
    inbound_nodes:
    - - - c3x3_6
        - 0
        - 0
        - {}
    name: relu_17
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_15
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_17
        - 0
        - 0
        - {}
    name: c1x1_15
  - class_name: Add
    config: {name: add_6, trainable: true}
    inbound_nodes:
    - - - relu_15
        - 0
        - 0
        - &id013 {}
      - - c1x1_15
        - 0
        - 0
        - *id013
    name: add_6
  - class_name: Activation
    config: {activation: relu, name: relu_18, trainable: true}
    inbound_nodes:
    - - - add_6
        - 0
        - 0
        - {}
    name: relu_18
  - class_name: Dropout
    config: {name: do_3, rate: 0.05, trainable: true}
    inbound_nodes:
    - - - relu_18
        - 0
        - 0
        - {}
    name: do_3
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: down2_3
      padding: valid
      pool_size: !!python/tuple [2, 2]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - do_3
        - 0
        - 0
        - {}
    name: down2_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_16
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_3
        - 0
        - 0
        - {}
    name: c1x1_16
  - class_name: Activation
    config: {activation: relu, name: relu_19, trainable: true}
    inbound_nodes:
    - - - c1x1_16
        - 0
        - 0
        - {}
    name: relu_19
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_7
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_19
        - 0
        - 0
        - {}
    name: c3x3_7
  - class_name: Activation
    config: {activation: relu, name: relu_20, trainable: true}
    inbound_nodes:
    - - - c3x3_7
        - 0
        - 0
        - {}
    name: relu_20
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id008
      name: c1x1_18
      padding: valid
      strides: *id009
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_3
        - 0
        - 0
        - {}
    name: c1x1_18
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_17
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_20
        - 0
        - 0
        - {}
    name: c1x1_17
  - class_name: Add
    config: {name: add_7, trainable: true}
    inbound_nodes:
    - - - c1x1_18
        - 0
        - 0
        - &id014 {}
      - - c1x1_17
        - 0
        - 0
        - *id014
    name: add_7
  - class_name: Activation
    config: {activation: relu, name: relu_21, trainable: true}
    inbound_nodes:
    - - - add_7
        - 0
        - 0
        - {}
    name: relu_21
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_19
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_21
        - 0
        - 0
        - {}
    name: c1x1_19
  - class_name: Activation
    config: {activation: relu, name: relu_22, trainable: true}
    inbound_nodes:
    - - - c1x1_19
        - 0
        - 0
        - {}
    name: relu_22
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_8
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_22
        - 0
        - 0
        - {}
    name: c3x3_8
  - class_name: Activation
    config: {activation: relu, name: relu_23, trainable: true}
    inbound_nodes:
    - - - c3x3_8
        - 0
        - 0
        - {}
    name: relu_23
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_20
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_23
        - 0
        - 0
        - {}
    name: c1x1_20
  - class_name: Add
    config: {name: add_8, trainable: true}
    inbound_nodes:
    - - - relu_21
        - 0
        - 0
        - &id015 {}
      - - c1x1_20
        - 0
        - 0
        - *id015
    name: add_8
  - class_name: Activation
    config: {activation: relu, name: relu_24, trainable: true}
    inbound_nodes:
    - - - add_8
        - 0
        - 0
        - {}
    name: relu_24
  - class_name: Dropout
    config: {name: do_4, rate: 0.05, trainable: true}
    inbound_nodes:
    - - - relu_24
        - 0
        - 0
        - {}
    name: do_4
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: down2_4
      padding: valid
      pool_size: !!python/tuple [2, 2]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - do_4
        - 0
        - 0
        - {}
    name: down2_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_21
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_4
        - 0
        - 0
        - {}
    name: c1x1_21
  - class_name: Activation
    config: {activation: relu, name: relu_25, trainable: true}
    inbound_nodes:
    - - - c1x1_21
        - 0
        - 0
        - {}
    name: relu_25
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_9
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_25
        - 0
        - 0
        - {}
    name: c3x3_9
  - class_name: Activation
    config: {activation: relu, name: relu_26, trainable: true}
    inbound_nodes:
    - - - c3x3_9
        - 0
        - 0
        - {}
    name: relu_26
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1024
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id008
      name: c1x1_23
      padding: valid
      strides: *id009
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - down2_4
        - 0
        - 0
        - {}
    name: c1x1_23
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1024
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_22
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_26
        - 0
        - 0
        - {}
    name: c1x1_22
  - class_name: Add
    config: {name: add_9, trainable: true}
    inbound_nodes:
    - - - c1x1_23
        - 0
        - 0
        - &id016 {}
      - - c1x1_22
        - 0
        - 0
        - *id016
    name: add_9
  - class_name: Activation
    config: {activation: relu, name: relu_27, trainable: true}
    inbound_nodes:
    - - - add_9
        - 0
        - 0
        - {}
    name: relu_27
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_24
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_27
        - 0
        - 0
        - {}
    name: c1x1_24
  - class_name: Activation
    config: {activation: relu, name: relu_28, trainable: true}
    inbound_nodes:
    - - - c1x1_24
        - 0
        - 0
        - {}
    name: relu_28
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_10
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_28
        - 0
        - 0
        - {}
    name: c3x3_10
  - class_name: Activation
    config: {activation: relu, name: relu_29, trainable: true}
    inbound_nodes:
    - - - c3x3_10
        - 0
        - 0
        - {}
    name: relu_29
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1024
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_25
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_29
        - 0
        - 0
        - {}
    name: c1x1_25
  - class_name: Add
    config: {name: add_10, trainable: true}
    inbound_nodes:
    - - - relu_27
        - 0
        - 0
        - &id017 {}
      - - c1x1_25
        - 0
        - 0
        - *id017
    name: add_10
  - class_name: Activation
    config: {activation: relu, name: relu_30, trainable: true}
    inbound_nodes:
    - - - add_10
        - 0
        - 0
        - {}
    name: relu_30
  - class_name: Dropout
    config: {name: do_5, rate: 0.05, trainable: true}
    inbound_nodes:
    - - - relu_30
        - 0
        - 0
        - {}
    name: do_5
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      name: up2_1
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - do_5
        - 0
        - 0
        - {}
    name: up2_1
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_1, trainable: true}
    inbound_nodes:
    - - - up2_1
        - 0
        - 0
        - &id018 {}
      - - do_4
        - 0
        - 0
        - *id018
    name: concatenate_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_26
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: c1x1_26
  - class_name: Activation
    config: {activation: relu, name: relu_31, trainable: true}
    inbound_nodes:
    - - - c1x1_26
        - 0
        - 0
        - {}
    name: relu_31
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_11
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_31
        - 0
        - 0
        - {}
    name: c3x3_11
  - class_name: Activation
    config: {activation: relu, name: relu_32, trainable: true}
    inbound_nodes:
    - - - c3x3_11
        - 0
        - 0
        - {}
    name: relu_32
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id008
      name: c1x1_28
      padding: valid
      strides: *id009
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: c1x1_28
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_27
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_32
        - 0
        - 0
        - {}
    name: c1x1_27
  - class_name: Add
    config: {name: add_11, trainable: true}
    inbound_nodes:
    - - - c1x1_28
        - 0
        - 0
        - &id019 {}
      - - c1x1_27
        - 0
        - 0
        - *id019
    name: add_11
  - class_name: Activation
    config: {activation: relu, name: relu_33, trainable: true}
    inbound_nodes:
    - - - add_11
        - 0
        - 0
        - {}
    name: relu_33
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_29
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_33
        - 0
        - 0
        - {}
    name: c1x1_29
  - class_name: Activation
    config: {activation: relu, name: relu_34, trainable: true}
    inbound_nodes:
    - - - c1x1_29
        - 0
        - 0
        - {}
    name: relu_34
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_12
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_34
        - 0
        - 0
        - {}
    name: c3x3_12
  - class_name: Activation
    config: {activation: relu, name: relu_35, trainable: true}
    inbound_nodes:
    - - - c3x3_12
        - 0
        - 0
        - {}
    name: relu_35
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_30
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_35
        - 0
        - 0
        - {}
    name: c1x1_30
  - class_name: Add
    config: {name: add_12, trainable: true}
    inbound_nodes:
    - - - relu_33
        - 0
        - 0
        - &id020 {}
      - - c1x1_30
        - 0
        - 0
        - *id020
    name: add_12
  - class_name: Activation
    config: {activation: relu, name: relu_36, trainable: true}
    inbound_nodes:
    - - - add_12
        - 0
        - 0
        - {}
    name: relu_36
  - class_name: Dropout
    config: {name: do_6, rate: 0.05, trainable: true}
    inbound_nodes:
    - - - relu_36
        - 0
        - 0
        - {}
    name: do_6
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      name: up2_2
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - do_6
        - 0
        - 0
        - {}
    name: up2_2
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_2, trainable: true}
    inbound_nodes:
    - - - up2_2
        - 0
        - 0
        - &id021 {}
      - - do_3
        - 0
        - 0
        - *id021
    name: concatenate_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_31
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: c1x1_31
  - class_name: Activation
    config: {activation: relu, name: relu_37, trainable: true}
    inbound_nodes:
    - - - c1x1_31
        - 0
        - 0
        - {}
    name: relu_37
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_13
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_37
        - 0
        - 0
        - {}
    name: c3x3_13
  - class_name: Activation
    config: {activation: relu, name: relu_38, trainable: true}
    inbound_nodes:
    - - - c3x3_13
        - 0
        - 0
        - {}
    name: relu_38
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id008
      name: c1x1_33
      padding: valid
      strides: *id009
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: c1x1_33
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_32
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_38
        - 0
        - 0
        - {}
    name: c1x1_32
  - class_name: Add
    config: {name: add_13, trainable: true}
    inbound_nodes:
    - - - c1x1_33
        - 0
        - 0
        - &id022 {}
      - - c1x1_32
        - 0
        - 0
        - *id022
    name: add_13
  - class_name: Activation
    config: {activation: relu, name: relu_39, trainable: true}
    inbound_nodes:
    - - - add_13
        - 0
        - 0
        - {}
    name: relu_39
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: c1x1_34
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_39
        - 0
        - 0
        - {}
    name: c1x1_34
  - class_name: Activation
    config: {activation: relu, name: relu_40, trainable: true}
    inbound_nodes:
    - - - c1x1_34
        - 0
        - 0
        - {}
    name: relu_40
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: c3x3_14
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_40
        - 0
        - 0
        - {}
    name: c3x3_14
  - class_name: Activation
    config: {activation: relu, name: relu_41, trainable: true}
    inbound_nodes:
    - - - c3x3_14
        - 0
        - 0
        - {}
    name: relu_41
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: c1x1_35
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - relu_41
        - 0
        - 0
        - {}
    name: c1x1_35
  - class_name: Add
    config: {name: add_14, trainable: true}
    inbound_nodes:
    - - - relu_39
        - 0
        - 0
        - &id023 {}
      - - c1x1_35
        - 0
        - 0
        - *id023
    name: add_14
  - class_name: Activation
    config: {activation: relu, name: relu_42, trainable: true}
    inbound_nodes:
    - - - add_14
        - 0
        - 0
        - {}
    name: relu_42
  - class_name: Dropout
